      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BULES-COBOL.
      ******************************************************************
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      *
      ******************************************************************
      *                       VARIABLES                                *
      ******************************************************************
      *
       77 WK-NUMBER                     PIC 9(2)        VALUES ZERO.
      *
      ******************************************************************
       PROCEDURE DIVISION.
      *
           PERFORM 1000-INICIO
           PERFORM 2000-PROCESO
           PERFORM 3000-FIN
           .
      *
      ******************************************************************
      *                       1000-INICIO                              *
      *----------------------------------------------------------------*
      *                                                                *
      *                                                                *
      ******************************************************************
       1000-INICIO.

      ******************************************************************
      *                       2000-PROCESO                             *
      *----------------------------------------------------------------*
      *                                                                *
      *                                                                *
      ******************************************************************
       2000-PROCESO.
      *
           PERFORM 2100-BUCLE1
           PERFORM 2200-BUCLE2
           PERFORM 2300-BUCLE3
           PERFORM 2400-BUCLE4
           .
      *
      ******************************************************************
      *                   2100-BUCLE1                                  *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2100-BUCLE1.
      *
           DISPLAY "REPITE HOLA 5 VECES"
           PERFORM 2500-SALUDO 5 TIMES
           DISPLAY "AÑADE 1 SIETE VECES"
           PERFORM 2600-AÑADIR1 7 TIMES
           DISPLAY WK-NUMBER
           .
      *
      ******************************************************************
      *                   2200-BUCLE2                                  *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2200-BUCLE2.
      *
           MOVE ZERO TO                                WK-NUMBER
               DISPLAY
               "INTRODUCE UN NÚMERO Y LLEGAREMOS A 10"
               ACCEPT WK-NUMBER
               IF WK-NUMBER IS ALPHABETIC
                   DISPLAY
                   "INTRODUCE UN NÚMERO MENOR QUE 10"
               ELSE
                   IF WK-NUMBER IS >= 10
                       THEN
                           DISPLAY
                           "INTRODUCE UN NÚMERO MENOR QUE 10"
                           PERFORM 2200-BUCLE2
                   ELSE
                       PERFORM 2700-MUESTRA-NUMERO
                       WITH TEST BEFORE
                       UNTIL WK-NUMBER = 10
               END-IF
               .
      *
      ******************************************************************
      *                   2300-BUCLE3                                  *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2300-BUCLE3.
      *
           MOVE ZERO TO                               WK-NUMBER
               DISPLAY
               "INTRODUCE UN NÚMERO Y LLEGAREMOS A 10"
               ACCEPT WK-NUMBER
               IF WK-NUMBER IS ALPHABETIC
                   DISPLAY
                   "INTRODUCE UN NÚMERO MENOR QUE 10"
               ELSE
                    IF WK-NUMBER IS >= 10 THEN
                        DISPLAY
                        "INTRODUCE UN NÚMERO MENOR QUE 10"
                        PERFORM 2300-BUCLE3
                    ELSE
                        PERFORM 2700-MUESTRA-NUMERO
                        WITH TEST AFTER
                        UNTIL WK-NUMBER = 10
               END-IF
               .
      *
      ******************************************************************
      *                   2400-BUCLE4                                  *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2400-BUCLE4.
      *
           DISPLAY "DE 15 A 30"
           PERFORM 2800-MUESTRA-NUMERO-BUCLES
           VARYING
           WK-NUMBER FROM 15 BY 1 UNTIL WK-NUMBER > 30
           .
      *
      ******************************************************************
      *                   2500-SALUDO                                  *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2500-SALUDO.
      *
           DISPLAY 'HOLA'
           .
      *
      ******************************************************************
      *                   2500-AÑADIR                                  *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2600-AÑADIR1.
      *
           ADD 1 TO WK-NUMBER
           *>DISPLAY WK-NUMBER
           .
      *
      ******************************************************************
      *                   2500-MUESTRA-NUMERO                          *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2700-MUESTRA-NUMERO.
      *
           ADD 1 TO WK-NUMBER
           DISPLAY WK-NUMBER
           .
      *
      ******************************************************************
      *                   2500-MUESTRA-NUMERO-BUCLES                   *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2800-MUESTRA-NUMERO-BUCLES.
      *
           DISPLAY WK-NUMBER
           .
      *
      ******************************************************************
      *                   3000-FIN                                     *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       3000-FIN.
      *
            STOP RUN
            .
      *
      ******************************************************************

