      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLASES.
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
      ******************************************************************
      *                      CLASES                                    *
      ******************************************************************
           CLASS 
               A-G 
               IS "A" THRU "G", "a" THRU "g", "7" THRU "9".
           CLASS 
               A-G-UPPER 
               IS "A" THRU "G".
           CLASS 
               A-G-LOWER 
               IS "a" THRU "g".
           CLASS 
               BINARIO 
               IS ZERO THRU "1".
           CLASS 
               HEX 
               IS ZERO THRU "9", "A" THRU "F", "a" THRU "f".
      ******************************************************************
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
      ******************************************************************
      *                      VARIABLES                                 *
      ******************************************************************
       01 WK-VALORES.
           05 WK-VALOR1           PIC X(4)      VALUE "ABCD".
           05 WK-VALOR2           PIC X(4)      VALUE "A9cD".
           05 WK-VALOR3           PIC X(4)      VALUE "0101".
           05 WK-VALOR4           PIC X(6)      VALUE "aC24FF".
      ******************************************************************
       PROCEDURE DIVISION.
      *
            PERFORM 1000-INICIO
            PERFORM 2000-PROCESO
            PERFORM 3000-FIN
            .
      * 
      ******************************************************************
      *                       1000-INICIO                              *
      *----------------------------------------------------------------*
      *                                                                * 
      *                                                                *
      ****************************************************************** 
       1000-INICIO.
      *         
               PERFORM 1100-INICIAR-VARIABLES.
      *         
      ******************************************************************
      *                   1100-INICIAR-VARIABLES                       *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************    
           1100-INICIAR-VARIABLES.
      * 
               MOVE SPACES                 TO  WK-VALOR1           
               MOVE SPACES                 TO  WK-VALOR2              
               MOVE SPACES                 TO  WK-VALOR3          
               MOVE SPACES                 TO  WK-VALOR4              
               .
      *
      ******************************************************************
      *                       2000-PROCESO                             *
      *----------------------------------------------------------------*
      *                                                                *
      *                                                                *
      ******************************************************************
       2000-PROCESO.
      *      
               PERFORM 2100-SOLICITA-VALOR1
               PERFORM 2101-COMPRUEBA-VALOR1
               PERFORM 2200-SOLICITA-VALOR2
               PERFORM 2201-COMPRUEBA-VALOR2
               PERFORM 2300-SOLICITA-VALOR3
               PERFORM 2301-COMPRUEBA-VALOR3
               PERFORM 2400-SOLICITA-VALOR4
               PERFORM 2401-COMPRUEBA-VALOR4
               PERFORM 3000-FIN
               .
      *
      ******************************************************************
      *                   2100-SOLICITA-VALOR1                         *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
           2100-SOLICITA-VALOR1.
      *
               DISPLAY 
               "--------------------------------------------"
               DISPLAY
               "Introduce cuatro caracteres en mayúscula entre A y G:"
               DISPLAY 
               "--------------------------------------------"
               ACCEPT WK-VALOR1
               .
      *
      ******************************************************************
      *                   2101-COMPRUEBA-VALOR1                        *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
           2101-COMPRUEBA-VALOR1. 
      *
               IF WK-VALOR1 
                   IS A-G-UPPER OR WK-VALOR1 IS A-G-LOWER 
                   THEN
                   DISPLAY 
                   "--------------------------------------------"
                   DISPLAY 
                   "Has escrito " WK-VALOR1 " y está en el rango"
                   DISPLAY 
                   "--------------------------------------------"
               ELSE
                   DISPLAY 
                   "--------------------------------------------"
                   DISPLAY 
                   "Has escrito " WK-VALOR1 " y no está en el rango"
                   DISPLAY 
                   "--------------------------------------------"
               END-IF
               .
      *
      ******************************************************************
      *                   2200-COMPRUEBA-VALOR1                        *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
           2200-SOLICITA-VALOR2.                        
      *
               DISPLAY
               "Introduce cuatro caracteres:"
               DISPLAY 
               "--------------------------------------------"
               ACCEPT WK-VALOR2
               .
      ******************************************************************
      *                   2201-COMPRUEBA-VALOR2                        *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2201-COMPRUEBA-VALOR2.
      *
           IF WK-VALOR2 
               IS A-G 
               THEN
               DISPLAY 
               "--------------------------------------------"
               DISPLAY 
               "Has escrito " WK-VALOR2 " y está en el rango"
               DISPLAY 
               "--------------------------------------------"
           ELSE
               DISPLAY 
               "--------------------------------------------"
               DISPLAY 
               "Has escrito " WK-VALOR2 " y no está en el rango"
               DISPLAY 
               "--------------------------------------------"
               DISPLAY 
               "INTÉNTALO DE NUEVO"
               DISPLAY 
               "--------------------------------------------"
               ACCEPT WK-VALOR2
               DISPLAY 
               "--------------------------------------------"
           IF WK-VALOR2 
               IS A-G 
               THEN
               DISPLAY
               "--------------------------------------------"
               DISPLAY
               "Has escrito " WK-VALOR2 " y está en el rango"
               DISPLAY
               "--------------------------------------------"
           ELSE
               DISPLAY
               "--------------------------------------------"
               DISPLAY
               "Has escrito dos veces y fuera de rango"
               DISPLAY
               "--------------------------------------------"
               DISPLAY "ÚLTIMO INTENTO"
               DISPLAY
               "--------------------------------------------"
               ACCEPT WK-VALOR2
               DISPLAY
               "--------------------------------------------"
           IF WK-VALOR2 
               IS A-G 
               THEN
               DISPLAY
               "--------------------------------------------"
               DISPLAY
               "Has escrito " WK-VALOR2 " y está en el rango"
               DISPLAY
               "--------------------------------------------"
           ELSE
               DISPLAY
               "--------------------------------------------"
               DISPLAY
               "Has escrito tres veces y fuera de rango"
               DISPLAY
               "--------------------------------------------"
           END-IF
           .
      *
      ******************************************************************
      *                   2300-SOLICITA-VALOR3                         *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
           2300-SOLICITA-VALOR3.                        
      *
               DISPLAY 
               "Introduce un binario de 4 dígitos:"
               DISPLAY 
               "--------------------------------------------"
               ACCEPT WK-VALOR3
               .
      *
      ******************************************************************
      *                   2301-COMPRUEBA-VALOR3                        *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       2301-COMPRUEBA-VALOR3.
      *
           IF WK-VALOR3 
               IS BINARIO 
               THEN
               DISPLAY 
               "--------------------------------------------"
               DISPLAY 
               "Has escrito " WK-VALOR3 " y está en el rango"
               DISPLAY 
               "--------------------------------------------"
           ELSE
               DISPLAY 
               "--------------------------------------------"
               DISPLAY 
               "Has escrito " WK-VALOR3 " y no está en el rango"
               DISPLAY 
               "--------------------------------------------"
           END-IF
               .
      *         
      ******************************************************************
      *                   2400-SOLICITA-VALOR4                         *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
           2400-SOLICITA-VALOR4.                        
      *
               DISPLAY 
               "Introduce un hexadecimal de 6 dígitos:"
               DISPLAY 
               "--------------------------------------------"
               ACCEPT WK-VALOR4
               .
      *
      ******************************************************************
      *                   2401-COMPRUEBA-VALOR4                        *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
           2401-COMPRUEBA-VALOR4.                        
      *
               IF WK-VALOR4 
                   IS HEX 
                   THEN
                   DISPLAY 
                   "--------------------------------------------"
                   DISPLAY 
                   "Has escrito " WK-VALOR4 " y está en el rango"
                   DISPLAY 
                   "--------------------------------------------"
               ELSE
                   DISPLAY 
                   "--------------------------------------------"
                   DISPLAY 
                   "Has escrito " WK-VALOR4 " y no está en el rango"
                   DISPLAY 
                   "--------------------------------------------"
               END-IF
               .
      *
      ******************************************************************
      *                       3000-FIN                                 *
      *----------------------------------------------------------------*
      *                                                                *
      ******************************************************************
       3000-FIN.
      *
            STOP RUN.
      *
      ******************************************************************
